-- first zapros
EXPLAIN ANALYZE
SELECT peop."ИМЯ", sess."ЧЛВК_ИД"
FROM "Н_ЛЮДИ" peop
JOIN "Н_СЕССИЯ" sess ON peop."ИД" = sess."ЧЛВК_ИД"
WHERE peop."ИМЯ" < 'Роман' AND sess."ИД" = 27640;


/*Nested Loop  (cost=0.28..126.21 rows=1 width=17) (actual time=0.393..0.394 rows=0 loops=1)
"  ->  Seq Scan on ""Н_СЕССИЯ"" sess  (cost=0.00..117.90 rows=1 width=4) (actual time=0.043..0.389 rows=1 loops=1)"
"        Filter: (""ИД"" = 27640)"
        Rows Removed by Filter: 3751
"  ->  Index Scan using ""ЧЛВК_PK"" on ""Н_ЛЮДИ"" peop  (cost=0.28..8.30 rows=1 width=17) (actual time=0.002..0.002 rows=0 loops=1)"
"        Index Cond: (""ИД"" = sess.""ЧЛВК_ИД"")"
"        Filter: ((""ИМЯ"")::text < 'Роман'::text)"
Planning Time: 0.354 ms
Execution Time: 0.447 ms
*/

/* без индексов
   План один хэщ табла + Hash Join
    Полный скан таблицы Н_СЕССИЯ и фильтрация по ИД = 27640. Получившиеся строки идут в хэщ-таблицу
   Полный скан табл Н_ЛЮДИ и фильтр по ИМЯ < 'РОМАН'. Применяет Hash Join и сопоставляем ИД со строками из хэш таблицы по ЧЛВК_ИД

   План два
   Полный скан таблицы Н_СЕССИЯ + фильтр ИД = 27640
   Соединение таблиц с помощью Nested Loop по атрибуту Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
   фильтрация по ИМЯ< 'РОМАН'

   План три
      Полный скан таблицы Н_СЕССИЯ + фильтр ИД = 27640
       Полный скан таблицы Н_ЛЮДИ + фильтр ИМЯ< 'РОМАН'
    Соединение таблиц с помощью Nested Loop по атрибуту Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД


   Третий план круче, т.к. Н_СЕССИЯ возвращает нам одну строку, и соед происходит после фильтрации.
   Первый план тоже не плох, но он был бы полезнее, если бы кол-во строк было бы большим, а это не так
 */

/* С индексами
    Главное избавится от Seq scan, полного сканирования

   1)  таблица Н_СЕССИЯ на атрибут ИД, повесить hash индекс. Так как равно при хэш подходит идеально, и так же он не явл внешним ключом
   2)  таблица Н_ЛЮДИ на атрибут ИМЯ повесить B-tree индекс. Берем диапозон, и удобнее идти по дереву
   3) таблица Н_СЕССИЯ на атрибут ЧЛВК_ИД повесить B-tree индекс. Внешний ключ
   4) таблица Н_ЛЮДИ на атрибут ИД повесить B-tree. Так он все таки является внешним, и может использовать с ним не только =
 */


/* план при добавление индекса
    Вместо полного скана будет использовать Index scan, мгновенно найдется Н_СЕССИЯ.ИД=27640
   и выполнит соединение по условие, за очень маленькое время так как на Н_ЛЮДИ.ИД весит индекс.
 */



-- second zapros
EXPLAIN ANALYSE
SELECT peop."ФАМИЛИЯ", stat."ЧЛВК_ИД", sess."ДАТА"
FROM "Н_ЛЮДИ" peop
JOIN "Н_ВЕДОМОСТИ" stat ON peop."ИД" = stat."ЧЛВК_ИД"
JOIN "Н_СЕССИЯ" sess ON peop."ИД" = sess."ЧЛВК_ИД"
WHERE peop."ИМЯ" = 'Ярослав' AND stat."ИД" = 1_426_978 AND sess."УЧГОД" > '2003/2004';


/*Nested Loop  (cost=2.53..35.90 rows=1 width=28) (actual time=0.027..0.028 rows=0 loops=1)
  ->  Nested Loop  (cost=0.70..17.63 rows=1 width=24) (actual time=0.027..0.028 rows=0 loops=1)
"        ->  Index Scan using ""ВЕД_PK"" on ""Н_ВЕДОМОСТИ"" stat  (cost=0.42..8.44 rows=1 width=4) (actual time=0.013..0.014 rows=1 loops=1)"
"              Index Cond: (""ИД"" = 1426978)"
"        ->  Index Scan using ""ЧЛВК_PK"" on ""Н_ЛЮДИ"" peop  (cost=0.28..8.30 rows=1 width=20) (actual time=0.009..0.009 rows=0 loops=1)"
"              Index Cond: (""ИД"" = stat.""ЧЛВК_ИД"")"
"              Filter: ((""ИМЯ"")::text = 'Ярослав'::text)"
              Rows Removed by Filter: 1
"  ->  Bitmap Heap Scan on ""Н_СЕССИЯ"" sess  (cost=1.83..18.12 rows=15 width=12) (never executed)"
"        Recheck Cond: (peop.""ИД"" = ""ЧЛВК_ИД"")"
"        Filter: ((""УЧГОД"")::text > '2003/2004'::text)"
"        ->  Bitmap Index Scan on ""SYS_C003500_IFK""  (cost=0.00..1.83 rows=18 width=0) (never executed)"
"              Index Cond: (""ЧЛВК_ИД"" = peop.""ИД"")"
Planning Time: 0.589 ms
Execution Time: 0.069 ms
*/

/* без индекса План
    1) Полный скан таблицы Н_ВЕДОМОСТИ + фильтрация по ИД = 1_426_978 и запись выданых строк в хэш таблицу.
    Полный скан таблицы Н_ЛЮДИ + фильтрация по ИМЯ = 'Ярослав' и соединения hash join с хэш таблицей
   Полный скан таблицы Н_СЕССИЯ + фильтрация по УЧГОД > '2003/2004' и hash join с хэш таблицей

   2) Полный скан таблицы Н_ВЕДОМОСТИ + фильтрация по ИД = 1_426_978
   Полный скан таблицы Н_ЛЮДИ + фильтрация по ИМЯ = 'Ярослав' и соединения с таблицей Н_ВЕДОМОСТИ Nested Loop
   Полный скан таблицы Н_СЕССИЯ + фильтрация по УЧГОД > '2003/2004' и соединения с соединеним первых двух таблиц Nested Loop.

   Второй план лучше, так как после первой фильтрации по ИД, строчек будет мало, и тогда
   нет смысла тратить память на хэш
 */

/* с индексами
   1) Таблица Н_ВЕДОМОСТИ на атрибут ИД повесить Hash.
   2) Таблица Н_ЛЮДИ атрибут ИМЯ повесить Hash индекс.
   3) Таблица Н_СЕССИЯ атрибут УЧГОД повесить B-tree индекс.
   4) Таблица Н_ВЕДОМОСТИ атрибут ЧЛВК_ИД повесить B-tree индекс, внешний ключ.
   5) Таблица Н_СЕССИЯ атрибут ЧЛВК_ИД повесить B-tree индекс, внешний ключ.
   6) Таблица Н_ЛЮДИ атрибут ИД повесить B-tree индекс

 */

/* план с индексами
 использование индекс скан, поможет мгновенно найдти нужную ИД в Н_ВЕДОМОСТИ
   Соединится с таблицей Н_ЛЮДИ по ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД, и если будет несколько строк, то испольует индекс на ИМЯ
   И далее обратиться к таблице Н_СЕССИЯ, и благодаря индексу на УЧГОД почти мгновенно выдаст результат
 */