package commands;

import network.Request;
import network.Response;

/**
 * Абстрактный базовый класс для всех серверных команд в приложении.
 * Данный класс определяет единый интерфейс и общую структуру для каждой команды,
 * включая её идентификатор, описание и количество необходимых аргументов.
 * Реализует паттерн проектирования Command на стороне сервера.
 */
public abstract class Command {
    /**
     * Уникальный идентификатор команды из перечисления Commands.
     */
    private final Commands name;

    /**
     * Текстовое описание функционала команды для формирования справки.
     */
    private final String description;

    /**
     * Конструктор для инициализации базовых свойств серверной команды.
     *
     * @param name        Уникальное имя (тип) команды из перечисления Commands.
     * @param description Краткое описание того, что делает команда (используется для help).
     */
    public Command(Commands name, String description) {
        this.name = name;
        this.description = description;
    }

    /**
     * Возвращает строковое имя команды.
     *
     * @return Имя команды в формате строки.
     */
    public String getName() {
        return name.name();
    }

    /**
     * Возвращает текстовое описание команды.
     *
     * @return Строка с описанием действия команды.
     */
    public String getDescription() {
        return description;
    }

    /**
     * Возвращает количество строковых аргументов, необходимых для выполнения команды.
     * По умолчанию возвращает 0. Переопределяется в классах-наследниках, если
     * команде требуются параметры (например, id).
     *
     * @return Требуемое количество аргументов.
     */
    public int getRequiredArgsCount() {
        return 0;
    }

    /**
     * Абстрактный метод, реализующий основную логику выполнения команды.
     * Должен быть переопределен в каждом конкретном классе команды.
     *
     * @param request Объект запроса, содержащий все необходимые данные (аргументы, объект)
     *                для выполнения операции на сервере.
     * @return Объект ответа (Response) с результатом выполнения команды.
     */
    public abstract Response execute(Request request);
}